README.org
*** Disable modeline during startup
#+begin_src emacs-lisp
(when (and (not (daemonp))
           (not noninteractive)
           (not init-file-debug))
  (put 'mode-line-format
       'initial-value (default-toplevel-value 'mode-line-format))
  (setq-default mode-line-format nil)
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (setq mode-line-format nil))))
#+end_src

** UI elements
Set a small number of UI defaults early, while avoiding unnecessary frame
redraws during startup.

In particular, this does the following:

- Disable the splash screen (=inhibit-splash-screen=).
- Disable the menu bar, tool bar, and scroll bars primarily via frame
  parameters (rather than calling =menu-bar-mode=, =tool-bar-mode=, or
  =scroll-bar-mode= during startup).
- Defer =tool-bar-setup= until after the user init file has loaded (when
  relevant), then run it only if =tool-bar-mode= remains enabled.
- Disable tooltips and graphical dialogue boxes.

#+begin_src emacs-lisp
(setq inhibit-splash-screen t)

(unless (assq 'menu-bar-lines default-frame-alist)
  (push '(menu-bar-lines . 0) default-frame-alist))
(unless (memq window-system '(mac ns))
  (setq menu-bar-mode nil))

(defun minimal-emacs--setup-toolbar (&rest _)
  "Set up the tool bar."
  (when (fboundp 'tool-bar-setup)
    (advice-remove 'tool-bar-setup #'ignore)
    (when (bound-and-true-p tool-bar-mode)
      (funcall 'tool-bar-setup))))

(when (and (not (daemonp))
           (not noninteractive))
  (when (fboundp 'tool-bar-setup)
    (advice-add 'tool-bar-setup :override #'ignore)

    (advice-add 'startup--load-user-init-file :after
                #'minimal-emacs--setup-toolbar)))

(push '(tool-bar-lines . 0) default-frame-alist)
(setq tool-bar-mode nil)

(setq default-frame-scroll-bars 'right)
(push '(vertical-scroll-bars) default-frame-alist)
(push '(horizontal-scroll-bars) default-frame-alist)
(setq scroll-bar-mode nil)

(when (bound-and-true-p tooltip-mode)
  (tooltip-mode -1))

(setq use-file-dialog nil)
(setq use-dialog-box nil)
#+end_src

** Security
Require certificate verification for TLS connections, and prefer stronger
cryptographic parameters.

#+begin_src emacs-lisp
(setq gnutls-verify-error t)
(setq tls-checktrust t)
(setq gnutls-min-prime-bits 3072)
#+end_src
** Miscellaneous
*** Default encoding
This is 2026, use UTF-8 encoding.

#+begin_src emacs-lisp
(set-language-environment "UTF-8")
#+end_src

*** Increase maximum process read threshold
Increase the maximum number of bytes to read from subprocess in a single chunk. This is useful if the subprocess generates very large (megabytes) amounts of data in one go.

We increase it to 2 MiB.

#+begin_src emacs-lisp
(setq read-process-output-max
      (* 2 1024 1024))
#+end_src

Tell Emacs to immediately read outputs from subprocesses. Do not batch them even if the outputs are small.
#+begin_src emacs-lisp
(setq process-adaptive-read-buffering nil)
#+end_src

*** Prevent pinging hostnames that have a known domain.

#+begin_src emacs-lisp
(setq ffap-machine-p-known 'reject)
#+end_src

*** Silence warnings
Increase the severity threshold at which Emacs reports diagnostics.

#+begin_src emacs-lisp
(setq warning-minimum-level :error
      warning-suppress-types '((lexical-binding)))
#+end_src

Disable warnings from the legacy advice API as well.

#+begin_src emacs-lisp
(setq ad-redefinition-action 'accept)
#+end_src

** Conclusion
Restore the original value of the garbage collection parameters.

#+begin_src emacs-lisp
(emacs--restore-gc-values)
#+end_src
* Configuration
:PROPERTIES:
:HEADER-ARGS:EMACS-LISP: :tangle init.el
:END:

** Core
*** Behaviours
**** Ask to terminate asynchronous compilation
This prevents native compilation from leaving temporary files in =/tmp=.

#+begin_src emacs-lisp
(setq native-comp-async-query-on-exit t)
#+end_src

**** Allow abbreviated responses
Allow users to respond =y= for yes and =n= for no.

#+begin_src emacs-lisp
(setq read-answer-short t)
(if (boundp 'use-short-answers)
    (setq use-short-answers t)
  (advice-add 'yes-or-no-p :override #'y-or-n-p))
#+end_src

**** Undo limit
#+begin_src emacs-lisp
(setq undo-limit (* 13 160000)
      undo-strong-limit (* 13 240000)
      undo-outer-limit (* 13 24000000))
#+end_src

*** Minibuffer
**** Allow nested minibuffers
#+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)
#+end_src

**** No cursor in read-only sections of minibuffer
#+begin_src emacs-lisp
(setq minibuffer-prompt-properties
      '(read-only t
        intangible t
        cursor-intangible t
        face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

*** User interface
This section configures broadly visible UI behaviour. None of this depends on
external packages.

Concretely:

- Reduce how often UI elements are refreshed by setting =which-func-update-delay=.
- For older Emacs versions where =idle-update-delay= exists (it is /obsolete/ in Emacs 30.1 and newer), keep it consistent with =which-func-update-delay=.
- Never display the built-in hello file (=view-hello-file=).
- Disable both audible and visible bells (=ring-bell-function= and =visible-bell=).

#+begin_src emacs-lisp
(setq which-func-update-delay 1.0)
(when (boundp 'idle-update-delay)
  (setq idle-update-delay which-func-update-delay))

(defalias #'view-hello-file #'ignore)

(setq visible-bell nil
      ring-bell-function #'ignore)
#+end_src

*** Parentheses matching
#+begin_src emacs-lisp
(setq show-paren-delay 0.1
      show-paren-highlight-openparen t
      show-paren-when-point-inside-paren t
      show-paren-when-point-in-periphery t)
#+end_src

*** Miscellaneous
Small quality-of-life defaults that do not warrant their own section:

- Ensure the =*Customize*= buffer is killed after finishing (=custom-buffer-done-kill=).
- Let =whitespace-mode= use =fill-column= (=whitespace-line-column= set to =nil=).
- Set sane defaults for =display-line-numbers-mode=.
- Use a clear ellipsis character (=truncate-string-ellipsis=).
- Do not truncate printed s-expressions in =M-:= (=eval-expression-print-length= and =eval-expression-print-level=).
- Place underlines at the descent line (=x-underline-at-descent-line=).
- Keep Imenu indices up to date (=imenu-auto-rescan=) and avoid truncating long items (=imenu-max-item-length=).
- Avoid creating newlines by accident when moving past the end of the buffer (=next-line-add-newlines=).
- Save bookmarks immediately after changes (=bookmark-save-flag=).

#+begin_src emacs-lisp
(setq custom-buffer-done-kill t)

(setq whitespace-line-column nil)

(setq-default display-line-numbers-width 3
              display-line-numbers-widen t)

(setq truncate-string-ellipsis "…")

(setq eval-expression-print-length nil
      eval-expression-print-level nil)

(setq x-underline-at-descent-line t)

(setq remote-file-name-inhibit-cache 50)

(setq imenu-auto-rescan t)

(setq imenu-max-item-length 160)

(setq next-line-add-newlines nil)

(setq bookmark-save-flag 1)
#+end_src

** Files, buffers, and persistence
*** TRAMP
#+begin_src emacs-lisp
(setq tramp-verbose 1
      tramp-completion-reread-directory-timeout 50)
#+end_src

*** Files
These defaults are primarily about reducing friction when visiting and managing
files.

- Prefer moving deletions to the system trash when interactive (=delete-by-moving-to-trash=).
- Suppress redundant warnings when re-visiting a file that is already open (=find-file-suppress-same-file-warnings=).
- Resolve symlinks up-front (=find-file-visit-truename=) and let VC follow symlinks without prompting (=vc-follow-symlinks=).
- Prefer vertical splits by default (=split-width-threshold= and =split-height-threshold=).

#+begin_src emacs-lisp
(setq delete-by-moving-to-trash (not noninteractive)
      remote-file-name-inhibit-delete-by-moving-to-trash t)

(setq find-file-suppress-same-file-warnings t)

(setq find-file-visit-truename t
      vc-follow-symlinks t)

(setq split-width-threshold 170
      split-height-threshold nil)
#+end_src

*** Buffers
#+begin_src emacs-lisp
(setq uniquify-buffer-name-style 'forward)
#+end_src

*** Comint
#+begin_src emacs-lisp
(setq ansi-color-for-comint-mode t
      comint-prompt-read-only t
      comint-buffer-maximum-size 4096)
#+end_src

*** Compilation
Assume compilation buffers are disposable, and avoid prompts that interrupt the
flow of iterating.

- Do not ask before saving buffers prior to compilation (=compilation-ask-about-save=).
- Always kill a running compilation when starting a new one (=compilation-always-kill=).
- Auto-scroll compilation output to the first error (=compilation-scroll-output=).
- Do not ask for confirmation when visiting non-existent files or buffers (=confirm-nonexistent-file-or-buffer=).

#+begin_src emacs-lisp
(setq compilation-ask-about-save nil
      compilation-always-kill t
      compilation-scroll-output 'first-error)

(setq confirm-nonexistent-file-or-buffer nil)
#+end_src

*** Backups
This configuration disables lockfiles and backups by default to avoid creating
world-readable copies of files, especially in shared directories.

The remaining backup settings are still specified so that, if backups are later
re-enabled, they are

- stored under =user-emacs-directory=,
- versioned, with old versions pruned automatically, and
- created by copying (as it is safer for some workflows and filesystems).

#+begin_src emacs-lisp
(setq create-lockfiles nil
      make-backup-files nil)

(setq backup-directory-alist
      `(("." . ,(expand-file-name "backup" user-emacs-directory))))
(setq tramp-backup-directory-alist backup-directory-alist)
(setq backup-by-copying-when-linked t)
(setq backup-by-copying t)
(setq delete-old-versions t)
(setq version-control t)
(setq kept-new-versions 5)
(setq kept-old-versions 5)
#+end_src

*** Version control
#+begin_src emacs-lisp
(setq vc-git-print-log-follow t
      vc-make-backup-files nil
      vc-git-diff-switches '("--histogram"))
#+end_src

*** Auto-save
This section configures auto-save behaviour. Auto-save is disabled by default
via =auto-save-default=, but the remaining settings ensure that if any buffer
enables auto-save it behaves quietly and keeps its files under
=user-emacs-directory=.

- Keep auto-save quiet (=auto-save-no-message=).
- Do not disable auto-save after large deletions (=auto-save-include-big-deletions=).
- Store auto-save lists under =user-emacs-directory=, including TRAMP auto-saves.
- Delete auto-save files when killing buffers (=kill-buffer-delete-auto-save-files=).
- Avoid duplicates in the kill ring (=kill-do-not-save-duplicates=).

#+begin_src emacs-lisp
(setq auto-save-default nil
      auto-save-no-message t
      auto-save-include-big-deletions t)

(setq auto-save-list-file-prefix
      (expand-file-name "autosave/" user-emacs-directory))
(setq tramp-auto-save-directory
      (expand-file-name "tramp-autosave/" user-emacs-directory))

(setq kill-buffer-delete-auto-save-files t)

(setq kill-do-not-save-duplicates t)
#+end_src

