README.org
*** Auto-revert
Keep buffers in sync with on-disk changes without prompting. Apply the same
behaviour to non-file buffers such as Dired (=global-auto-revert-non-file-buffers=),
while ignoring modes that are known to misbehave (=global-auto-revert-ignore-modes=).

#+begin_src emacs-lisp
(setq revert-without-query (list ".")
      auto-revert-stop-on-user-input nil
      auto-revert-verbose t)

(setq global-auto-revert-non-file-buffers t
      global-auto-revert-ignore-modes '(Buffer-menu-mode))
#+end_src

*** Recent files
Increase =recentf= capacity beyond the default, while keeping the menu itself
compact.

#+begin_src emacs-lisp
(setq recentf-max-saved-items 300
      recentf-max-menu-items 15
      recentf-auto-cleanup 'mode
      recentf-exclude nil)
#+end_src

*** Save place
#+begin_src emacs-lisp
(setq save-place-file (expand-file-name "saveplace" user-emacs-directory)
      save-place-limit 600)
#+end_src

*** Save history
Persist minibuffer history across sessions, and additionally retain common
editing state such as the kill ring, registers, marks, and search history.

#+begin_src emacs-lisp
(setq history-length 300
      savehist-save-minibuffer-history t)
(setq savehist-additional-variables
      '(kill-ring
        register-alist
        mark-ring global-mark-ring
        search-ring regexp-search-ring))
#+end_src

** Display
*** Frames and windows
Prefer stable window sizing and consistent separators:

- Disable pixelwise window resizing (=window-resize-pixelwise=).
- Allow minibuffer windows to grow only (=resize-mini-windows=).
- Define divider widths explicitly via =window-divider-default-*=.

#+begin_src emacs-lisp
(setq window-resize-pixelwise nil)

(setq resize-mini-windows 'grow-only)

(setq window-divider-default-bottom-width 1
      window-divider-default-places t
      window-divider-default-right-width 1)
#+end_src

*** Fontification
Skip fontification during user input to reduce latency in large buffers.

#+begin_src emacs-lisp
(setq redisplay-skip-fontification-on-input t)
#+end_src

*** Scrolling
Favour smooth and predictable scrolling behaviour:

- Permit faster but occasionally imprecise scrolling (=fast-but-imprecise-scrolling=).
- Move point to the top or bottom before signalling a scrolling error (=scroll-error-top-bottom=).
- Preserve screen position when scrolling (=scroll-preserve-screen-position=).
- Reduce eager recentring (=scroll-conservatively=).
- Avoid random vertical jumps on long lines (=auto-window-vscroll=).
- Keep margins and context lines conservative (=scroll-margin= and =next-screen-context-lines=).
- Configure horizontal scrolling (=hscroll-margin= and =hscroll-step=).

#+begin_src emacs-lisp
(setq fast-but-imprecise-scrolling t)
(setq scroll-error-top-bottom t)
(setq scroll-preserve-screen-position t)
(setq scroll-conservatively 20)
(setq auto-window-vscroll nil)
(setq scroll-margin 0)
(setq next-screen-context-lines 0)

(setq hscroll-margin 2
      hscroll-step 1)
#+end_src

*** Mouse
Insert mouse-yanked text at the click location rather than at point, and enable
GUI context menus when available.

#+begin_src emacs-lisp
(setq mouse-yank-at-point nil)

(when (and (display-graphic-p) (fboundp 'context-menu-mode))
  (add-hook 'after-init-hook #'context-menu-mode))
#+end_src

*** Cursor
Reduce visual noise and a small amount of rendering work:

- Disable the blinking cursor (=blink-cursor-mode=).
- Do not blink matching parentheses (=blink-matching-paren=).
- Do not stretch the cursor to wide characters (=x-stretch-cursor=).
- Avoid rendering cursors and regions in non-selected windows (=cursor-in-non-selected-windows=).

#+begin_src emacs-lisp
(when (bound-and-true-p blink-cursor-mode)
  (blink-cursor-mode -1))

(setq blink-matching-paren nil)

(setq x-stretch-cursor nil)

(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
#+end_src

** Editing
*** Text editing, indentation, and formatting
This section defines defaults for interactive editing. The intent is to favour
predictable behaviour and keep routine operations responsive.

**** Rescaling and deletion feedback
Avoid automatic frame resizing when adjusting text scale, and keep paired
deletion feedback brief.

#+name: config-editing-rescaling-and-deletion
#+begin_src emacs-lisp :tangle no
(setq global-text-scale-adjust-resizes-frames nil)
(setq delete-pair-blink-delay 0.03)
#+end_src

**** Fringes and indicators
Define narrow, consistent fringes, and disable fringe indicators for buffer
boundaries and empty lines.

#+name: config-editing-fringes
#+begin_src emacs-lisp :tangle no
(setq-default left-fringe-width 8
              right-fringe-width 8
              indicate-buffer-boundaries nil
              indicate-empty-lines nil)
#+end_src

**** Wrapping
Enable =word-wrap= while truncating long lines by default, as soft wrapping can
be expensive in large buffers.

#+name: config-editing-wrapping
#+begin_src emacs-lisp :tangle no
(setq-default word-wrap t
              truncate-lines t)
(setq truncate-partial-width-windows nil)
#+end_src

**** Indentation and completion
Prefer spaces over tabs, restrict electric indentation to newline and DEL, and
enable TAB-based indentation and completion.

#+name: config-editing-indentation
#+begin_src emacs-lisp :tangle no
(setq-default electric-indent-chars '(?\n ?\^?)
              indent-tabs-mode nil
              tab-width 4)

(setq tab-always-indent 'complete)
(setq tab-first-completion 'word-or-paren-or-punct)

(setq read-extended-command-predicate #'command-completion-default-include-p)
#+end_src

**** Commenting and layout
Keep commenting predictable, use a conventional =fill-column=, avoid
typewriter-era double spacing at sentence ends, and ensure files end with a
newline.

#+name: config-editing-commenting-and-layout
#+begin_src emacs-lisp :tangle no
(setq comment-multi-line t
      comment-empty-lines t)

(setq-default fill-column 80)

(setq sentence-end-double-space nil)
(setq require-final-newline t)
#+end_src

**** Search highlighting
Highlight search matches immediately.

#+name: config-editing-search-highlighting
#+begin_src emacs-lisp :tangle no
(setq lazy-highlight-initial-delay 0)
#+end_src

**** Putting it all together
#+begin_src emacs-lisp :noweb yes
<<config-editing-rescaling-and-deletion>>

<<config-editing-fringes>>

<<config-editing-wrapping>>

<<config-editing-indentation>>

<<config-editing-commenting-and-layout>>

<<config-editing-search-highlighting>>
#+end_src

*** Modeline
Do not display the system load average in the mode line.

#+begin_src emacs-lisp
(setq display-time-default-load-average nil)
#+end_src

*** File type behaviour
Reduce noisy heuristics in mode-specific indentation logic.

#+begin_src emacs-lisp
(setq python-indent-guess-indent-offset-verbose nil)

(setq sh-indent-after-continuation 'always)
#+end_src

** Built-in packages
*** Dired and ls-lisp
Dired defaults favour predictable recursive operations and reduce the number of
confirmation prompts.

**** Dired defaults
#+begin_src emacs-lisp
(setq dired-free-space nil
      dired-dwim-target t
      dired-deletion-confirmer 'y-or-n-p
      dired-filter-verbose nil
      dired-recursive-deletes 'top
      dired-recursive-copies 'always
      dired-vc-rename-file t
      dired-create-destination-dirs 'ask
      dired-clean-confirm-killing-deleted-buffers nil)
#+end_src

**** Auto-revert integration
Use =dired-buffer-stale-p= to determine when a Dired buffer should be refreshed,
while avoiding automatic reverts for remote directories.

#+begin_src emacs-lisp
(setq auto-revert-remote-files nil
      dired-auto-revert-buffer 'dired-buffer-stale-p)
#+end_src

**** Omit files
Keep =dired-omit-mode= quiet and omit the =.= entry.

#+begin_src emacs-lisp
(setq dired-omit-verbose nil
      dired-omit-files (concat "\\`[.]\\'"))
#+end_src

**** ls-lisp
Prefer listing directories first, and avoid verbose output in =ls-lisp=.

#+begin_src emacs-lisp
(setq ls-lisp-verbosity nil
      ls-lisp-dirs-first t)
#+end_src

*** Ediff
Use a single frame and split windows horizontally.

#+begin_src emacs-lisp
(setq ediff-window-setup-function 'ediff-setup-windows-plain
      ediff-split-window-function 'split-window-horizontally)
#+end_src

*** Help
Make =apropos= search more extensively, and avoid completion mechanisms that
trigger autoloads when invoking help commands.

#+begin_src emacs-lisp
(setq apropos-do-all t)

(setq help-enable-completion-autoload nil
      help-enable-autoload nil
      help-enable-symbol-autoload nil
      help-window-select t)
#+end_src

*** Eglot
Keep Eglot responsive by avoiding UI blocking during connection establishment,
and reduce log and progress noise.

**** Connection behaviour
#+begin_src emacs-lisp
(setq eglot-sync-connect 0
      eglot-autoshutdown t
      eglot-extend-to-xref t)
#+end_src

**** Logging and progress reporting
#+begin_src emacs-lisp
(setq jsonrpc-event-hook nil)
(when (boundp 'eglot-events-buffer-size)
  (setq eglot-events-buffer-size 0))
(setq eglot-events-buffer-config '(:size 0 :format short))

(setq eglot-report-progress nil)
#+end_src

*** Flymake
#+begin_src emacs-lisp
(setq flymake-show-diagnostics-at-end-of-line nil
      flymake-wrap-around nil)
#+end_src

*** hl-line
Restrict hl-line highlighting to the current window.

#+begin_src emacs-lisp
(setq hl-line-sticky-flag nil
      global-hl-line-sticky-flag nil)
#+end_src

*** Icomplete
Do not delay displaying completion candidates.

#+begin_src emacs-lisp
(setq icomplete-compute-delay 0.01)
#+end_src

*** Flyspell
#+begin_src emacs-lisp
(setq flyspell-issue-welcome-flag nil
      flyspell-issue-message-flag nil)
#+end_src

*** Ispell
Avoid errors in Emacs 30 and newer when no dictionary is configured, and save
the personal dictionary silently.

#+begin_src emacs-lisp
(setq text-mode-ispell-word-completion nil)

(setq ispell-silently-savep t)
#+end_src

*** Ibuffer
#+begin_src emacs-lisp
(setq ibuffer-formats
      '((mark modified read-only locked
              " " (name 55 55 :left :elide)
              " " (size 8 -1 :right)
              " " (mode 18 18 :left :elide) " " filename-and-process)
        (mark " " (name 16 -1) " " filename)))
#+end_src

*** Xref
Use minibuffer completion for both definitions and cross-reference lists.

#+begin_src emacs-lisp
(setq xref-show-definitions-function 'xref-show-definitions-completing-read
      xref-show-xrefs-function 'xref-show-definitions-completing-read)
#+end_src

*** Abbrev
Store =abbrev_defs= under =user-emacs-directory= and save abbreviations
silently.

#+begin_src emacs-lisp
(setq abbrev-file-name (expand-file-name "abbrev_defs" user-emacs-directory))

(setq save-abbrevs 'silently)
#+end_src

